In [2]:
import numpy as np
import pandas as pd

In [3]:
first_series = pd.Series(list('abcdef'))

In [4]:
print (first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

# Create series from ndarray

In [5]:
np_country = np.array(['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden','Singapore','Denmark'])

In [6]:
s_country = pd.Series(np_country)

In [7]:
print(s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

# Create dataframe from lists

In [8]:
#last five olympics data: place, year and number of countries participated

olympic_data_list = {'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                    'Year':[2012,2008,2004,2000,1996],
                    'No. of Participating Countries':[205,204,201,200,197]}

In [9]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [10]:
df_olympic_data

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

# View dataframe

In [11]:
#select by cityname
df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [12]:
#use describe function to display the content
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>